Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, None, None, 8 224         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, None, 8 224         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, None, None, 8 224         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, None, None, 8 224         input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 3 0           conv2d_4[0][0]                   
                                                                 conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, None, None, 3 9248        concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, None, None, 1 4624        conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, None, None, 1 4624        conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, None, None, 1 4624        conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, None, None, 1 4624        conv2d_6[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 6 0           conv2d_10[0][0]                  
                                                                 conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, None, None, 3 18464       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, None, None, 3 9248        conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, None, None, 3 9248        conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, None, None, 3 9248        conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, None, None, 3 9248        conv2d_12[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, 1 0           conv2d_16[0][0]                  
                                                                 conv2d_13[0][0]                  
                                                                 conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, None, None, 3 36896       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, None, None, 6 18496       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, None, None, 6 18496       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, None, None, 6 18496       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, None, None, 6 18496       conv2d_18[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, None, None, 2 0           conv2d_22[0][0]                  
                                                                 conv2d_19[0][0]                  
                                                                 conv2d_20[0][0]                  
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, None, None, 2 0           concatenate_4[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, None, None, 3 0           up_sampling2d_1[0][0]            
                                                                 concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, None, None, 8 27656       concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, None, None, 8 27656       concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, None, None, 8 27656       concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, None, None, 8 27656       concatenate_5[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, None, None, 3 0           conv2d_27[0][0]                  
                                                                 conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, None, None, 3 0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, None, None, 8 2312        up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, None, None, 8 2312        up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, None, None, 8 2312        up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, None, None, 8 2312        up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, None, None, 3 0           conv2d_32[0][0]                  
                                                                 conv2d_29[0][0]                  
                                                                 conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, None, None, 9 0           concatenate_2[0][0]              
                                                                 concatenate_7[0][0]              
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, None, None, 9 0           concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, None, None, 8 6920        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, None, None, 8 6920        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, None, None, 8 6920        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, None, None, 8 6920        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, None, None, 3 9248        concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, None, None, 3 0           conv2d_37[0][0]                  
                                                                 conv2d_34[0][0]                  
                                                                 conv2d_35[0][0]                  
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, None, None, 3 9248        conv2d_39[0][0]                  
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, None, None, 6 0           concatenate_9[0][0]              
                                                                 conv2d_40[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, None, 6 256         concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, None, None, 3 18464       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, None, None, 3 1056        conv2d_41[0][0]                  
__________________________________________________________________________________________________
out (Conv2D)                    (None, None, None, 3 99          conv2d_42[0][0]                  
==================================================================================================
Total params: 380,899
Trainable params: 380,771
Non-trainable params: 128
__________________________________________________________________________________________________
